test-ci/1DWetAvalanche/Allrun
#!/bin/sh

rm -r 0
# Create the mesh
blockMesh

# Run sedFoam
sedFoam_rbgh

